Tekla Open API Reference for Tekla Structures 2025
Events.ModelChangedDelegate Delegate
 The delegate to use for database commit.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void ModelChangedDelegate()
Public Delegate Sub ModelChangedDelegate
See Also
Reference
Tekla.Structures.Model Namespace